## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.RBAC-AZTF-kv-uami-audit-logs will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-kv-uami-audit-logs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourcegroups/rg-aztf-logging-prod-ne-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-nc-log-dev-ne-001"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Service Encryption User"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-01/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-02"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>